
&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	Объект.ДанныеФайла.Очистить();
	
	Если Объект.ПутьКФайлу = "" Тогда
		Возврат;
	КонецЕсли;
	
	ПоследовательноеЧтение = Истина;
	
	Если Объект.ФорматФайла = "Все" Тогда
		
	Если СтрНайти(Объект.ПутьКФайлу, ".txt") ИЛИ СтрНайти(Объект.ПутьКФайлу, ".csv") Тогда
		
		ПрочитатьTXT_CSV(ПоследовательноеЧтение);	 		
	
	ИначеЕсли СтрНайти(Объект.ПутьКФайлу, "xls") ИЛИ СтрНайти(Объект.ПутьКФайлу, "xlsx") Тогда
		
		ПрочитатьXLS();	 		
	
	ИначеЕсли СтрНайти(Объект.ПутьКФайлу, "dbf") Тогда
		
		ПрочитатьDBF();	 		
	
	ИначеЕсли СтрНайти(Объект.ПутьКФайлу, "xml") Тогда
		
		Прочитать_XML();	 		
	
	КонецЕсли;
			
	ИначеЕсли Объект.ФорматФайла = "TXT" или Объект.ФорматФайла = "CSV" Тогда
		
		ПоследовательноеЧтение = Истина;
		ПрочитатьTXT_CSV(ПоследовательноеЧтение);
	
	ИначеЕсли Объект.ФорматФайла = "XLS" Тогда
		ПрочитатьXLS();		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Прочитать_XML()
	//TODO: Реализация
КонецПроцедуры

&НаСервере
Процедура ПрочитатьDBF()
	//TODO: Реализация
КонецПроцедуры

&НаСервере
Процедура ПрочитатьXLS()
	
	ТабДок = Новый ТабличныйДокумент();
	
	Попытка
		ТабДок. Прочитать(Объект.ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст ="Не удалось прочитать указанный файл по причине:" + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	Для НомерСтроки = 2 По КоличествоСтрок Цикл
		СтрокаДанных = Объект.ДанныеФайла.Добавить();
		
		ЦенаСтрокой       = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + "2").ТекущаяОбласть.Текст;
		КоличествоСтрокой = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + "3").ТекущаяОбласть.Текст;
		
		СтрокаДанных.Наименование 	= ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + "1").ТекущаяОбласть.Текст;
		СтрокаДанных.Цена 			= ПривестиСтрокуКЧислу(ЦенаСтрокой);
		СтрокаДанных.Количество 	= ПривестиСтрокуКЧислу(КоличествоСтрокой);
		СтрокаДанных.Стоимость		= СтрокаДанных.Цена * СтрокаДанных.Количество;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьTXT_CSV(ПоследовательноеЧтение)
	
	Если ПоследовательноеЧтение Тогда
		
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Объект.ПутьКФайлу);
		
		ТекСтрока = Текст.Прочитать();
		Пока ТекСтрока <> Истина Цикл
		
			МассивСлов = СтрРазделить(ТекСтрока, Символы.Таб + Символы.ПС);
			
			Если МассивСлов.Количество() < 3 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока =Объект.ДанныеФайла.Добавить();
			НоваяСтрока.Наименование = 	МассивСлов[0];
			НоваяСтрока.Цена         =	Число(МассивСлов[1]);
			НоваяСтрока.Количество   =	Число(МассивСлов[2]);
			НоваяСтрока.Стоимость    =	НоваяСтрока.Цена * НоваяСтрока.Количество;
			
			ТекСтрока = Текст.ПрочитатьСтроку();
			
		КонецЦикла;
	Иначе
		Текст = Новый ТекстовыйДокумент();
		Текст.Прочитать(Объект.ПутьКФайлу);
		Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл
			
			ТекСтрока = Текст.ПолучитьСтроку(НомерСтроки);
			МассивСлов = СтрРазделить(ТекСтрока, ";/\|" + Символы.Таб);
			
			Если МассивСлов.Количество() < 3 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока =Объект.ДанныеФайла.Добавить();
			НоваяСтрока.Наименование = 	МассивСлов[0];
			НоваяСтрока.Цена = 			МассивСлов[1];
			НоваяСтрока.Стоимость = 	МассивСлов[2];
			
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл с контрагентами";
	
	Если Объект.ФорматФайла = "Все" Тогда
		Фильтр = "Все файлы (*.*) |*.*";
	ИначеЕсли Объект.ФорматФайла = "TXT" Тогда
		Фильтр = "Текстовый документ (*.txt) |*.txt";
	ИначеЕсли Объект.ФорматФайла = "CSV" Тогда
		Фильтр = "Текстовый документ (*.csv) |*.csv";
	ИначеЕсли Объект.ФорматФайла = "XLS" Тогда
		Фильтр = "Excel (*.xls,*.xlsx) |*.xls,*.xlsx";
	ИначеЕсли Объект.ФорматФайла = "DBF" Тогда
		Фильтр = "Документ (*.dbf) |*.dbf";
	ИначеЕсли Объект.ФорматФайла = "XML" Тогда
		Фильтр = "Разметка (*.xml) |*.xml";
	Иначе 
		Возврат;
	КонецЕсли;
	
	Проводник.Фильтр = Фильтр;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ФорматФайла = "Все";
	
КонецПроцедуры

Функция ПривестиСтрокуКЧислу(ЧислоСтрокой, ВозвращатьНеопределено = Истина)
    
    ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
    ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
    
    Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
        
        Стр = Строка(ЧислоСтрокой);
        Если Стр = "" Тогда
            Возврат Неопределено;
        КонецЕсли;
        
        Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
        Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
            Возврат Неопределено;
        КонецЕсли;
    КонецЕсли;
    
    Возврат ЗначениеЧисла;    
    
КонецФункции

