
&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	Объект.ДанныеФайла.Очистить();
	
	Если Объект.ПутьКФайлу = "" Тогда
		Возврат;
	КонецЕсли;
	ПоследовательноеЧтение = Истина;
	
	Если ПоследовательноеЧтение Тогда
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Объект.ПутьКФайлу);
		
		ТекСтрока = Текст.Прочитать();
		Пока ТекСтрока <> Истина Цикл
		
			МассивСлов = СтрРазделить(ТекСтрока, ";/\|");
			
			Если МассивСлов.Количество() < 3 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока =Объект.ДанныеФайла.Добавить();
			НоваяСтрока.Наименование = 	МассивСлов[0];
			НоваяСтрока.Цена         =	Число(МассивСлов[1]);
			НоваяСтрока.Количество   =	Число(МассивСлов[2]);
			НоваяСтрока.Стоимость    =	НоваяСтрока.Цена * НоваяСтрока.Количество;
			
			ТекСтрока = Текст.ПрочитатьСтроку();
			
		КонецЦикла;
	Иначе
		Текст = Новый ТекстовыйДокумент();
		Текст.Прочитать(Объект.ПутьКФайлу);
		Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл
			
			ТекСтрока = Текст.ПолучитьСтроку(НомерСтроки);
			МассивСлов = СтрРазделить(ТекСтрока, ";/\|");
			
			Если МассивСлов.Количество() < 3 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока =Объект.ДанныеФайла.Добавить();
			НоваяСтрока.Наименование = 	МассивСлов[0];
			НоваяСтрока.Цена = 			МассивСлов[1];
			НоваяСтрока.Стоимость = 	МассивСлов[2];
			
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл с контрагентами";
	
	Если Объект.ФорматФайла = "TXT" Тогда
		Фильтр = "Текстовый документ (*.txt) |*.txt";
	ИначеЕсли Объект.ФорматФайла = "CVS" Тогда
		Фильтр = "Текстовый документ (*.cvs) |*.cvs";
	ИначеЕсли Объект.ФорматФайла = "XLS" Тогда
		Фильтр = "Текстовый документ (*.xls) |*.xls";
	ИначеЕсли Объект.ФорматФайла = "DBF" Тогда
		Фильтр = "Текстовый документ (*.dbf) |*.dbf";
	ИначеЕсли Объект.ФорматФайла = "XML" Тогда
		Фильтр = "Текстовый документ (*.xml) |*.xml";
	Иначе 
		Возврат;
	КонецЕсли;
	
	Проводник.Фильтр = Фильтр;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	
КонецПроцедуры
