
&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл с контрагентами";
	ф=1;
	
	Если Объект.ФорматФайла = "TXT" Тогда
		Фильтр = "Текстовый документ (*.txt) |*.txt";
	ИначеЕсли Объект.ФорматФайла = "CVS" Тогда
		Фильтр = "Текстовый документ (*.cvs) |*.cvs";
	ИначеЕсли Объект.ФорматФайла = "XLS" Тогда
		Фильтр = "Текстовый документ (*.xls) |*.xls";
	ИначеЕсли Объект.ФорматФайла = "DBF" Тогда
		Фильтр = "Текстовый документ (*.dbf) |*.dbf";
	ИначеЕсли Объект.ФорматФайла = "XML" Тогда
		Фильтр = "Текстовый документ (*.xml) |*.xml";
	Иначе 
		Возврат;
	КонецЕсли;
	
	Проводник.Фильтр = Фильтр;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	
КонецПроцедуры
